<template>
  <v-card>
    <v-subheader>Информация</v-subheader>
    <v-card-text style="padding-top:0px;">
      <div class="text-xs-left">
        <p>
          Это загрузчик сообщений ВК. Введите валидный токен или войдите используя пароль.
          Затем выберите чаты, тип файлов и нажмите скачать.
        </p>
        <p>Загрузка осуществляется через токен apidog.ru, которое ВК считает доверенным приложением и 
            разрешает ему качать переписки. Данный сайт работает только на клиенте, не имеет серверной 
            части и доступ к вашим данным имеете только вы, ВК, и apidog.ru. Никаких других запросов данное 
            приложение не отправляет, в этом можно убедиться отследив запросы (например, через панель разработчика chrome).</p>
        <p>
          Данный сайт предназначен для использования
          <b>исключительно</b> со своим аккаунтом, и его целью является архивация
          <b>собственной</b> переписки.
        </p>
        <p>
          Автор не несет ответственности за последствия вызванные использованием сайта не по назначению. Да и по назначению тоже, автор
          <b>вообще</b> не несет ответственности.
          Любые манипуляции вы проводите на свой страх и риск.
        </p>
        <p>
            Принимаю любые пожертвования <a href="https://money.yandex.ru/to/410017309153417">Яндекс Деньги</a>
        </p>
      </div>Сделал
      <a href="https://zpix1.github.io" target="_blank">@zpix</a> в 2019<br>
      <a href="mailto:zpix-dev@list.ru" target="_blank">zpix-dev@list.ru</a>
      
    </v-card-text>
  </v-card>
</template>

<script>
export default {
  name: "About"
};
</script>
