<template>
  <div>
    <v-dialog v-model="moreInformationModel" width="700">
      <v-card>
        <v-card-text>
          <p class="title">История версий</p>
          <p>
            <b>v1.0</b> Релиз <br>
            <b>v1.1</b> Повышен лимит чатов для закачки с 40 до 1000 (имейте в виду, что реально он меньше, так как удаляются все беседы и сообщения групп) <br>
            <b>v1.2</b> Добавлена поддержка большего числа видов вложений (видео/аудио); улучшения загрузчика <br>
            <b>v1.3</b> Добавлен скрипт загрузки вложений; добавлен выбор промежутков <br>
            <b>v1.4</b> Добавлена возможность выбора диалогов по отдельности <br>
            <b>v1.5</b> Добавлена поддержка выкачки бесед и сообщений с группами <br>
            <b>v1.5.1</b> Изменен алгоритм проверки кодов; пользователи, уже купившие коды не должны пострадать, если все же не работает - пишите мне <br>
            <b>v1.5.2</b> Исправлена ошибка "Too many requests per second" <br>
          </p>
          <!-- <p class="title">Возможные проблемы</p>
          <p>Проблемы сети - скорее вс</p> -->
          <p class="title">Общая информация</p>
          <p>JSON - идентично apidog'овскому формату, можно засунуть в их анализатор<br>
             HTML - отображение диалога как в ВК (только некоторые типы вложений не отбражаются)<br>
             В итоге скачается архив .zip с 6 степенью сжатия, что неплохо уменьшает размер диалогов
          </p>

          <p>
            Загрузка осуществляется через токен apidog.ru, которое ВК считает доверенным приложением и
            разрешает ему качать переписки. 
            </p><p>Данный сайт работает только на клиенте, не имеет серверной
            части и доступ к вашим данным имеете только вы, ВК, и apidog.ru. Никаких других запросов данное
            приложение не отправляет, в этом можно убедиться отследив запросы (например, через панель разработчика chrome).
          </p>
          <p>
            Данный сайт предназначен для использования
            <b>исключительно</b> со своим аккаунтом, и его целью является архивация
            <b>собственной</b> переписки.
          </p>
          <p>
            Автор не несет ответственности за последствия вызванные использованием сайта не по назначению. Да и по назначению тоже, автор
            <b>вообще</b> не несет ответственности.
            Любые манипуляции вы проводите на свой страх и риск.
          </p>
        </v-card-text>
        <v-card-actions>
          <v-spacer></v-spacer>
          <v-btn color="primary" flat @click="moreInformationModel = false">Закрыть</v-btn>
        </v-card-actions>
      </v-card>
    </v-dialog>
    <v-card>
      <v-subheader>Информация</v-subheader>
      <v-card-text style="padding-top:0px;">
        <div class="text-xs-left">
          <p>
            Это загрузчик сообщений ВК. Введите валидный токен или войдите используя пароль.
            Затем выберите чаты, тип файлов и нажмите скачать.
          </p>
          <p>
            <a @click="moreInformationModel = true">Больше информации</a>
          </p>

          <!-- <p>
            Принимаю любые пожертвования
            <a
              href="https://money.yandex.ru/to/410017309153417"
            >Яндекс Деньги</a>
          </p> -->
        </div>Сделал
        <a href="https://zpix1.github.io" target="_blank">@zpix</a> в 2019
        <br>
        <a href="mailto:zpix-dev@list.ru" target="_blank">zpix-dev@list.ru</a>
      </v-card-text>
    </v-card>
  </div>
</template>

<script>
export default {
  name: "About",
  data: function() {
    return {
      moreInformationModel: false
    };
  }
};
</script>
